# 3 Представим Вы создали сайт онлайн курсов по Python. Ваша задача спросить у пользователя Python
# ФУНКЦИЮ и если такая есть исполнить и вернуть пользователю результат иначе сказать что в Python
# такой функции нет!

# list1 = ['eval', 'abs']
# func = input('введите функцию: ')
# if func =='abs':
#     digit = int(input('введите отрицательное число: '))
#     print(abs(digit))
# elif func == 'eval':
#     digit = input('введите данные: ')
#     print(eval(digit))
# else:
#     print('такой функции нет!')